---
type: RebarShapeVertex
namespace: Autodesk.Revit.DB.Structure
version: 2024
members: 6
tags: [revit-api, class]
---

# RebarShapeVertex

`Autodesk.Revit.DB.Structure.RebarShapeVertex` · Revit 2024 · 6 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | Dispose | — | `public void Dispose ()` |
| Method | GetConstraints | 2012 | `public IList < RebarShapeConstraint > GetConstraints ()` |
| Method | SetConstraints | 2012 | `public void SetConstraints ( IList < RebarShapeConstraint > constraints )` |
| Property | BendAngle | 2012 | `public RebarShapeBendAngle BendAngle { get ; set ; }` |
| Property | IsValidObject | 2014 | `public bool IsValidObject { get ; }` |
| Property | Turn | 2012 | `public RebarShapeVertexTurn Turn { get ; set ; }` |